# ParameterGroup Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ExternalDefinition..::..ParameterGroup Property
ExternalDefinition Class See Also
---
Returns the group ID of the parameter definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public override BuiltInParameterGroup ParameterGroup { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property ParameterGroup As BuiltInParameterGroup
	Get
```

Visual C++
---
```text
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () override;
}
```

# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace